# Задание

Написать программу, которая из имеющегося массива строк формирует массив из строк,длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать  на старте выполнения алгоритма. Решение не через коллекции, а через массивы.

# Решение

## Ввод данных 
1. С клавиатуры, через запятую.
Запись в _переменную типа строка_.
2. split переменной по разделителю _запятая_ в строковый массив **array**

        string[] array=text.Split(",");

3. _цикл_ перебор значений массива **array** и проверка их длины:
если меньше либо равно 3, то записываем в строку переменую через запятую
     
        selection=selection+array[i]+",";

4. split переменной *selection* по разделителю _запятая_ в строковый массив **result**

         string[] result=selection.Split(",");

5. _цикл_ перебор значений массива **result** и вывод на печать через "запятую". Берем все элементы, кроме последних 2х (последний - будет пустой после split selection; предпоследний выведем отдельно с добавлением "]" вместо ",")

         for (int i = 0; i < result.Length-2; i++)
            {
            Console.Write (result[i]+",");
            }
        Console.Write (result[(result.Length-2)]+"]");

